import dependencies

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings("ignore")

data loading

In [2]:
data = {
    'Name': ['Arun', 'Ravi', 'Mohan', 'Sita', 'Geeta'],
    'Age': [25, 30, 22, 28, 24],
    'Salary': [50000, 60000, 52000, 58000, 55000],
    'City': ['Noida', 'Delhi', 'Mumbai', 'Chennai', 'Pune']
}
df = pd.DataFrame(data)
df

    Name  Age  Salary     City
0   Arun   25   50000    Noida
1   Ravi   30   60000    Delhi
2  Mohan   22   52000   Mumbai
3   Sita   28   58000  Chennai
4  Geeta   24   55000     Pune

In [3]:
#how to save data in diffrent format
df.to_csv('my_data.csv')#csv format

In [4]:
#how to save excel format
df.to_excel('my_data.xlsx')#excel format save

In [5]:
#how to save html format
df.to_html('my_data.html')

In [6]:
#how to save json format
df.to_json('my_data.json')

how to load data diffent format

In [8]:
data_csv = pd.read_csv('my_data.csv')
data_html = pd.read_html('my_data.html')
data_json = pd.read_json('my_data.json')
excel_data = pd.read_excel('my_data.xlsx')

In [9]:
data_csv

   Unnamed: 0   Name  Age  Salary     City
0           0   Arun   25   50000    Noida
1           1   Ravi   30   60000    Delhi
2           2  Mohan   22   52000   Mumbai
3           3   Sita   28   58000  Chennai
4           4  Geeta   24   55000     Pune

data explore

In [10]:
#head
#shape
#describe
#info
#coulumns
#null values
print(data_csv.shape)

(5, 5)

In [11]:
data_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  5 non-null      int64
 1   Name        5 non-null      object
 2   Age         5 non-null      int64
 3   Salary      5 non-null      int64
 4   City        5 non-null      object
dtypes: int64(3), object(2)
memory usage: 332.0+ bytes

In [12]:
data_csv.columns

Index(['Unnamed: 0', 'Name', 'Age', 'Salary', 'City'], dtype='object')

In [13]:
data_csv.describe()

       Unnamed: 0        Age        Salary
count    5.000000   5.000000      5.000000
mean     2.000000  25.800000  55000.000000
std      1.581139   3.193744   4123.105626
min      0.000000  22.000000  50000.000000
25%      1.000000  24.000000  52000.000000
50%      2.000000  25.000000  55000.000000
75%      3.000000  28.000000  58000.000000
max      4.000000  30.000000  60000.000000

In [14]:
data_csv.isnull().sum()

Unnamed: 0    0
Name          0
Age           0
Salary        0
City          0
dtype: int64

In [16]:
data_csv.duplicated().sum()

0

Top 5 rows dekhna: df.head()
Last 5 rows dekhna: df.tail()
Data ka size dekhna: df.shape
Summary dekhna: df.info()
Statistical summary: df.describe()
Columns list dekhna: df.columns
Missing values check karna: df.isnull().sum()

data cleaning

Duplicate rows hatana: df.drop_duplicates(inplace=True)
Missing values fill karna: df.fillna(value, inplace=True)
Missing values hataana: df.dropna(inplace=True)
Data type badalna: df['column'] = df['column'].astype(int)

In [17]:
data_csv

   Unnamed: 0   Name  Age  Salary     City
0           0   Arun   25   50000    Noida
1           1   Ravi   30   60000    Delhi
2           2  Mohan   22   52000   Mumbai
3           3   Sita   28   58000  Chennai
4           4  Geeta   24   55000     Pune

In [18]:
data_csv.drop(['Unnamed: 0'],axis=1,inplace= True)

In [19]:
data_csv

    Name  Age  Salary     City
0   Arun   25   50000    Noida
1   Ravi   30   60000    Delhi
2  Mohan   22   52000   Mumbai
3   Sita   28   58000  Chennai
4  Geeta   24   55000     Pune